import keepCalm from "../../img/landing/keepCalm.png";
import happyCommunity from "../../img/landing/happyCommunity.jpg";
import innovation from "../../img/landing/innovation.jpg";
import writersLove from "../../img/landing/writersLove.jpg";

export default {
    navbar: {
        home: 'Головна',
        register: 'Реєстрація',
        profile: 'Профіль',
        post: 'Опублікувати',
        logout: 'Вийти'
    },
    landing: {
        typedStrings: [
            'Твори на новому рівні!',
            'Спільне написання історій!',
            'Блискавичний чат!',
            'Підтримка найбільших соціальних мереж!',
            'Перетвори улюблену історію в аудіокнигу!',
            'Пиши історію з допомогою голосу, не торкаючись клавіатури!',
            'Легкий і приємний інтерфейс!',
            'YouTube відео всередині історій!',
            'Додай власні ілюстрації та обкладинку історії!',
            'Ніколи не здавайся, і ти досягнеш чогось великого!'
        ],
        heading: 'Що ж ми пропонуємо?',
        cards: [
            {
                image: keepCalm,
                imageAlt: 'Не хвилюйся ні про що і твори!',
                text: `На "Хвилі" ми не дозволимо незручному інтерфейсу та технічним проблемам заважати тобі!
                    ТИ — твориш! МИ — беремо на себе все інше!`,
                headingStrings: 'Сфокусуйся на важливому!',
            },
            {
                image: happyCommunity,
                imageAlt: 'Our Community',
                headingStrings: 'Наша спільнота!',
                text: 'Наші дбайливі користувачі допоможуть новим авторам покращити свої навички та развиватись! Бажаємо тобі знайти в нас багато друзів!'
            },
            {
                image: innovation,
                headingStrings: 'Час нових ідей!',
                imageAlt: 'We bring new ideas!',
                text: 'Ми збираємось додати стільки нових та захопливих функцій! Автоматичне читання, диктовка з допомогою мікрофона, спільне напсиання тексту та багато чого іншого чекає на тебе!'
            },
            {
                image: writersLove,
                headingStrings: 'Ми знаємо, чого тобі не вистачає!',
                imageAlt: 'Love',
                text: 'Цей сайт розробляється письменниками для письменників! Ми знаємо, чого тобі не вистачає і робимо це для тебе!'
            },
        ]
    },
};